In [3]:
import pandas as pd

In [9]:
data1 = pd.read_excel(r'C:\Users\dipak\Desktop\MyData.xlsx')

In [10]:
data1

       Name  Age    Salary
0     Dipak  23.0  40000.0
1   Darshan  23.0  42000.0
2     Viral  22.0  35000.0
3  Abhishek  20.0  30000.0

In [12]:
data2 = pd.read_csv(r'C:\Users\dipak\Desktop\MyData2.csv')

In [13]:
data2

       Name  Age  Salary      Occupation
0     Viral   25   20000           MscIt
1     Dipak   23   25000             MCA
2   Darshan   22   22000  Graphic Design
3  Abhishek   24   20000        Business

In [18]:
data3 = pd.read_csv(r'C:\Users\dipak\Desktop\MyData3.tsv', sep='\t')

In [19]:
data3

   RollNo     Name  Batch
0    1001    Dipak   1840
1    1002    Viral   1840
2    1003  Darshan   1840
3    1004    Pavan   1840